# ------------- CMC206 -------------
subjects = [
    [
        ['Практикум на ЭВМ 658'], 
        ['Практикум на ЭВМ', 'МЗ-1'], 
        ['Практикум на ЭВМ 582'],
        ['Математический анализ', 'Домрина А.В. 637'], 
        ['Физическая культура']
    ],
    [
        ['Теорвер и матстат', 'Королев В.Ю. П-13'], 
        ['Математический анализ П-11', 'Крицков Л.В.'], 
        ['Английский язык', 'Беликова Е.К. 580'], 
        ['Обыкновенные дифференциальные ур-я', 'Павельева Е.А. 660'], 
        ['Английский язык', 'Кашелкина О.А. 736']
    ],
    [
        ['Теорвер и матстат', 'Пономаренко Л.С. 508'],
        ['Математический анализ П-6', 'Крицков Л.В.'], 
        ['Обыкновенные дифференциальные ур-я П-13', 'Денисов А.М.'], 
        ['Межфакультетские курсы']
    ],
    [
        ['Операционные системы П-13', 'Машечкин И.В'], 
        ['Операционные системы П-13', 'Машечкин И.В'], 
        ['Математический анализ', 'Домрина А.В. 637'], 
        ['Введение в численные методы П-6', 'Нефёдов В.В.']
    ],
    [
        [''], 
        ['Физическая культура'], 
        ['Классическая механика', 'Аксёнов В.Н. 660'], 
        ['Английский язык', 'Беликова Е.К. 582-а', 'Кашелкина О.А. 783'], 
        ['Классическая механика ЦФА', 'Никитин С.Ю.'], 
    ],
    [
        ['Философия П-14', 'Девятова С.В.'], 
        ['--- / Философия', 'Девятова С.В. 505']
    ],
    [
         ['-'], 
         ['-'], 
         ['-']
    ]
]

times = [
    [['08:45', '10:20'], ['10:30', '12:05'], ['12:50', '14:25'], ['14:35', '16:10'], ['16:50', '18:20']],
    [['08:45', '10:20'], ['10:30', '12:05'], ['12:15', '13:50'], ['14:35', '16:10'], ['16:20', '17:55']],
    [['08:45', '10:20'], ['10:30', '12:05'], ['12:15', '13:50'], ['15:10', '18:30']],
    [['08:45', '10:20'], ['10:30', '12:05'], ['12:15', '13:50'], ['14:35', '16:10'], ['16:20', '17:55']],
    [['08:45', '10:20'], ['10:50', '12:20'], ['12:50', '14:25'], ['14:35', '16:10'], ['16:20', '17:55']],
    [['08:45', '10:20'], ['10:30', '12:05'], ['12:15', '13:50'], ['14:35', '16:10']],
    [['-'], ['-'], ['-']]
    ]




def add_str(arr, max_len, template_str):
    for i in range(len(arr), max_len):
        arr.append(template_str)
    return arr

def split(s, max_len):
    l = s.split()
    res = []
    buf = ""
    for i in l:
        if len(buf) == 0:
            buf = i
        elif len(buf) + 1 + len(i) < max_len:
            buf += " " + i
        else:
            res.append(buf)
            buf = i
    if len(buf) > 0:
        res.append(buf)
    return res


char_in_str = 21
f_out = open("schedule.txt", "w", encoding="utf-8")
for day in range(7):
    # print(f"-------------- day {day + 1} --------------")
    # print(f"/set {day + 1}")
    print("#", file=f_out)
    flag_separator = False
    print("```", file=f_out)
    for time, subj in zip(times[day], subjects[day]):
        if flag_separator:
            print("-------------", file=f_out)
        flag_separator = True
        new_subj = []
        for i in range(len(subj)):
            new_subj.extend(split(subj[i], char_in_str))
        subj = new_subj
        max_len = max(len(time), len(subj))
        add_str(time, max_len, "     ")
        add_str(subj, max_len, "")
        for i, j in zip(time, subj):
            print(f"{i} | {j}", file=f_out)
    print("```", file=f_out)
print("#", file=f_out)
f_out.close()















