subjects = [
    [
        ['Практикум на ЭВМ'], 
        ['Практикум на ЭВМ', 'МЗ-3'], 
        ['Теорвер и матстат', 'Королев В.Ю. П-12'], 
        ['Физическая культура'], 
        ['Правоведение П-14', 'Северин В.А.'], 
    ],
    [
        ['Английский язык', 'Кашелкина О.А. 783'], 
        ['Теорвер и матстат', 'Пономаренко Л.С. 508'], 
        ['Действительный и комплексный анализ', 'Домрина А.В. 637'], 
        ['']
    ],
    [
        ['Практикум на ЭВМ', 'Шестимеров А.А. 510'], 
        ['Действительный и комплексный анализ П-12', 'Крицков Л.В.'], 
        ['Обыкновенные дифференциальные ур-я П-14', 'Денисов А.М.'], 
        ['Межфакультетские курсы']
    ],
    [
        ['Системы программирования', 'Карпов Л.Е. П-14'], 
        ['Системы программирования', 'Карпов Л.Е. П-14'], 
        ['Обыкновенные дифференциальные ур-я', 'Павельева Е.А. 653'], 
        ['Английский язык', 'Беликова Е.К. 580', 'Кашелкина О.А. 71'], 
        ['Практикум на ЭВМ', 'Чернов А.В. 524']
    ],
    [
        [''], 
        ['Физическая культура'], 
        ['Электродинамика', 'Макаров В.А. ЦФА'], 
        ['']
    ],
    [
        ['Электродинамика', 'Урюпина Д.С. 660'], 
        ['Действительный и комплексный анализ П-5', 'Домрина А.В.'], 
        ['Действительный и комплексный анализ', 'Домрина А.В. 637'], 
        ['Английский язык', 'Беликова Е.К. 740']
    ],
    [
         ['-'], 
         ['-'], 
         ['-']
    ]
]

times = [
    [['08:45', '10:20'], ['10:30', '12:05'], ['12:15', '13:50'], ['14:20', '15:50'], ['17:20', '18:55']],
    [['08:45', '10:20'], ['10:30', '12:05'], ['12:15', '13:50'], ['14:35', '16:10'], ['16:20', '17:55']],
    [['08:45', '10:20'], ['10:30', '12:05'], ['12:15', '13:50'], ['15:10', '18:30']],
    [['08:45', '10:20'], ['10:30', '12:05'], ['12:15', '13:50'], ['14:35', '16:10'], ['16:20', '17:55']],
    [['08:45', '10:20'], ['10:00', '11:30'], ['12:40', '14:15'], ['14:35', '16:10'], ['16:20', '17:55']],
    [['08:45', '10:20'], ['10:30', '12:05'], ['12:15', '13:50'], ['14:35', '16:10']],
    [['-'], ['-'], ['-']]
    ]

def add_str(arr, max_len, template_str):
    for i in range(len(arr), max_len):
        arr.append(template_str)
    return arr

def split(s, max_len):
    l = s.split()
    res = []
    buf = ""
    for i in l:
        if len(buf) == 0:
            buf = i
        elif len(buf) + 1 + len(i) < max_len:
            buf += " " + i
        else:
            res.append(buf)
            buf = i
    if len(buf) > 0:
        res.append(buf)
    return res


char_in_str = 21

# for day in range(7):
#     print(f"-------------- day {day + 1} --------------")
#     print(f"/set {day + 1}")
#     for time, subj in zip(times[day], subjects[day]):
#         new_subj = []
#         for i in range(len(subj)):
#             new_subj.extend(split(subj[i], char_in_str))
#         subj = new_subj
#         max_len = max(len(time), len(subj))
#         add_str(time, max_len, "     ")
#         add_str(subj, max_len, "")
#         for i, j in zip(time, subj):
#             print(f"{i} | {j}")
#         print("-------------")


for day in range(7):
    # print(f"-------------- day {day + 1} --------------")
    # print(f"/set {day + 1}")
    print("#")
    flag_separator = False
    print("```")
    for time, subj in zip(times[day], subjects[day]):
        if flag_separator:
            print("-------------")
        flag_separator = True
        new_subj = []
        for i in range(len(subj)):
            new_subj.extend(split(subj[i], char_in_str))
        subj = new_subj
        max_len = max(len(time), len(subj))
        add_str(time, max_len, "     ")
        add_str(subj, max_len, "")
        for i, j in zip(time, subj):
            print(f"{i} | {j}")
    print("```")
print("#")
















