# =============================================================================
# # ------------- Mex201 -------------
# subjects = [
#     [
#         ['Теория вероятностей', '409'], 
#         ['Дифференциальные уравнения', 'П4'], 
#         ['Дифф. уравнения', '409'], 
#         ['Английский язык', '???'], 
#         ['', ''], 
#         ['', '']
#     ],
#     [
#         ['Английский язык', ''], 
#         ['Математический анализ', 'П3'], 
#         ['Физическое воспитание', ''], 
#         ['Математический анализ', '413'], 
#         ['Практикум по комп. геометрии / ---', '1610'], 
#         ['', '']
#     ],
#     [
#         ['Теория вероятностей', '1610'], 
#         ['Дифференциальная геометрия', '1603'], 
#         ['Дифференциальная геометрия', '1610'], 
#         ['МФК', ''], 
#         ['МФК', ''], 
#         ['', '']
#     ],
#     [
#         ['---', ''], 
#         ['---', ''], 
#         ['---', '']
#     ],
#     [
#         ['Действительный анализ', '1624'], 
#         ['Математический анализ', '1408'], 
#         ['Физическое воспитание', ''], 
#         ['Работа на ЭВМ', '1315'], 
#         ['', ''], 
#         ['', '']
#     ],
#     [
#         ['Работа на ЭВМ / ---', '1624'], 
#         ['Математический анализ', '1327'], 
#         ['Практикум по комп. геометрии / ---', '1305'], 
#         ['Действительный анализ', '1327'], 
#         ['', ''], 
#         ['', '']
#     ],
#     [
#         ['-'], 
#         ['-'], 
#         ['-']
#     ]
# ]
# 
# times = [
#     [['09:00', '10:35'], ['10:45', '12:20'], ['13:15', '14:50'], ['15:00', '16:35']],
#     [['09:00', '10:35'], ['10:45', '12:20'], ['13:15', '14:50'], ['15:00', '16:35'], ['16:45', '18:20']],
#     [['09:00', '10:35'], ['10:45', '12:20'], ['13:15', '14:50'], ['15:00', '16:35'], ['16:45', '18:20']],
#     [['09:00', '10:35'], ['10:45', '12:20'], ['13:15', '14:50'], ['15:00', '16:35']],
#     [['09:00', '10:35'], ['10:45', '12:20'], ['13:15', '14:50'], ['15:00', '16:35']],
#     [['09:00', '10:35'], ['10:45', '12:20'], ['13:15', '14:50'], ['15:00', '16:35']],
#     [['-'], ['-'], ['-']]
#     ]
# =============================================================================

# ------------- Mex201 -------------
subjects = [
    [
        ['Теория вероятностей', '409'], 
        ['Дифференциальные уравнения', 'П4'], 
        ['Дифференциальные уравнения', '409'], 
        ['', ''], 
        ['', ''], 
        ['', '']
    ],
    [
        ['', ''], 
        ['Математический анализ', 'П3'], 
        ['Физическое воспитание', ''], 
        ['Математический анализ', '413'], 
        ['', ''], 
        ['', '']
    ],
    [
        ['Теория вероятностей', '1610'], 
        ['Дифференциальная геометрия', '1603'], 
        ['Дифференциальная геометрия', '1610'], 
        ['МФК', ''], 
        ['МФК', ''], 
        ['', '']
    ],
    [
        ['---', ''], 
        ['---', ''], 
        ['---', '']
    ],
    [
        ['Действительный анализ', '1624'], 
        ['Математический анализ', '1408'], 
        ['Физическое воспитание', ''], 
        ['', ''], 
        ['', ''], 
        ['', '']
    ],
    [
        ['', ''], 
        ['Математический анализ', '1327'], 
        ['', ''], 
        ['Действительный анализ', '1327'], 
        ['', ''], 
        ['', '']
    ],
    [
        ['-'], 
        ['-'], 
        ['-']
    ]
]

times = [
    [['09:00', '10:35'], ['10:45', '12:20'], ['13:15', '14:50'], ['15:00', '16:35']],
    [['09:00', '10:35'], ['10:45', '12:20'], ['13:15', '14:50'], ['15:00', '16:35'], ['16:45', '18:20']],
    [['09:00', '10:35'], ['10:45', '12:20'], ['13:15', '14:50'], ['15:00', '16:35'], ['16:45', '18:20']],
    [['09:00', '10:35'], ['10:45', '12:20'], ['13:15', '14:50'], ['15:00', '16:35']],
    [['09:00', '10:35'], ['10:45', '12:20'], ['13:15', '14:50'], ['15:00', '16:35']],
    [['09:00', '10:35'], ['10:45', '12:20'], ['13:15', '14:50'], ['15:00', '16:35']],
    [['-'], ['-'], ['-']]
    ]







def add_str(arr, max_len, template_str):
    for i in range(len(arr), max_len):
        arr.append(template_str)
    return arr

def split(s, max_len):
    l = s.split()
    res = []
    buf = ""
    for i in l:
        if len(buf) == 0:
            buf = i
        elif len(buf) + 1 + len(i) < max_len:
            buf += " " + i
        else:
            res.append(buf)
            buf = i
    if len(buf) > 0:
        res.append(buf)
    return res


char_in_str = 21
f_out = open("schedule.txt", "w", encoding="utf-8")
for day in range(7):
    # print(f"-------------- day {day + 1} --------------")
    # print(f"/set {day + 1}")
    print("#", file=f_out)
    flag_separator = False
    print("```", file=f_out)
    for time, subj in zip(times[day], subjects[day]):
        if flag_separator:
            print("-------------", file=f_out)
        flag_separator = True
        new_subj = []
        for i in range(len(subj)):
            new_subj.extend(split(subj[i], char_in_str))
        subj = new_subj
        max_len = max(len(time), len(subj))
        add_str(time, max_len, "     ")
        add_str(subj, max_len, "")
        for i, j in zip(time, subj):
            print(f"{i} | {j}", file=f_out)
    print("```", file=f_out)
print("#", file=f_out)
f_out.close()















