# ------------- 211 -------------
subjects = [
    [
        [''], 
        ['Действительный и комплексный анализ П-14'], 
        ['Обыкновенные дифференциальные ур-я', '645'], 
        ['Физическая культура'], 
        ['Правоведение П-14', 'Северин В.А.']
    ],
    [
        ['Теорвер и матстат П-5'], 
        ['Действительный и комплексный анализ 605'], 
        ['Английский язык', 'Потапова 782'], 
        ['Действительный и комплексный анализ П-14']

    ],
    [
        ['Теорвер и матстат 606'], 
        ['Обыкновенные дифференциальные ур-я П-3'], 
        ['Действительный и комплексный анализ 605'], 
        ['Межфакультетские курсы']
    ],
    [

        ['Английский язык', 'Круглова 735'], 
        ['Электродинамика 659'], 
        ['Системы программирования П-14'], 
        ['Системы программирования П-14']

    ],
    [
        [''], 
        ['Физическая культура'], 
        ['Электродинамика ЦФА'], 
        ['Английский язык', 'Круглова 735', 'Потапова 790']
    ],
    [
        ['Практикум на ЭВМ 779 515'], 
        ['Практикум на ЭВМ 779 515'], 
        [''], 
        ['']
    ],
    [
         ['-'], 
         ['-'], 
         ['-']
    ]
]

times = [
    [['08:45', '10:20'], ['10:30', '12:05'], ['12:15', '13:50'], ['14:20', '15:50'], ['17:20', '18:55']],
    [['08:45', '10:20'], ['10:30', '12:05'], ['12:15', '13:50'], ['14:35', '16:10'], ['16:20', '17:55']],
    [['08:45', '10:20'], ['10:40', '12:15'], ['12:15', '13:50'], ['15:10', '18:30']],
    [['08:45', '10:20'], ['10:30', '12:05'], ['12:15', '13:50'], ['14:35', '16:10'], ['16:20', '17:55']],
    [['08:45', '10:20'], ['10:00', '11:30'], ['12:40', '14:15'], ['14:35', '16:10'], ['16:20', '17:55']],
    [['08:45', '10:20'], ['10:30', '12:05'], ['12:15', '13:50'], ['14:35', '16:10']],
    [['-'], ['-'], ['-']]
    ]






def add_str(arr, max_len, template_str):
    for i in range(len(arr), max_len):
        arr.append(template_str)
    return arr

def split(s, max_len):
    l = s.split()
    res = []
    buf = ""
    for i in l:
        if len(buf) == 0:
            buf = i
        elif len(buf) + 1 + len(i) < max_len:
            buf += " " + i
        else:
            res.append(buf)
            buf = i
    if len(buf) > 0:
        res.append(buf)
    return res


char_in_str = 21
f_out = open("schedule.txt", "w", encoding="utf-8")
for day in range(7):
    # print(f"-------------- day {day + 1} --------------")
    # print(f"/set {day + 1}")
    print("#", file=f_out)
    flag_separator = False
    print("```", file=f_out)
    for time, subj in zip(times[day], subjects[day]):
        if flag_separator:
            print("-------------", file=f_out)
        flag_separator = True
        new_subj = []
        for i in range(len(subj)):
            new_subj.extend(split(subj[i], char_in_str))
        subj = new_subj
        max_len = max(len(time), len(subj))
        add_str(time, max_len, "     ")
        add_str(subj, max_len, "")
        for i, j in zip(time, subj):
            print(f"{i} | {j}", file=f_out)
    print("```", file=f_out)
print("#", file=f_out)
f_out.close()















