# ------------- Phil237 -------------
subjects = [
    [
        [''], 
        ['Вероятностные модели', 'Лек 844'], 
        ['Лингвистическая типология', 'Лек 844'], 
        ['Французский', 'Сем 1028'], 
        ['Методика научной работы', 'Лек 844']
    ],
    [
        [''], 
        [''], 
        ['Синтаксис', 'Лек 844'], 
        ['Синтаксис', 'Сем 844'], 
        ['']
    ],
    [
        ['Французский', 'Сем 1028'], 
        ['Французский', 'Сем 1028'], 
        ['Физическая культура'], 
        ['МФК'], 
        [''], 
        ['']
    ],
    [
        ['Введение в прикладную лингвистику', 'Лек 950'], 
        ['Семантика', 'Сем 844 / Лек 844'], 
        ['Вероятностные модели', 'Сем 844'], 
        ['Психолигвистика', 'Лек 950'], 
        ['Психолигвистика', 'Сем 950']
    ],
    [
        [''], 
        ['Программирование', 'Лек 951'], 
        [''], 
        ['Программирование', 'Сем 951'], 
        ['Физическая культура'], 
        [''] 
    ],
    [
        [''], 
        [''], 
        [''], 
        [''], 
        [''], 
        ['']
    ],
    [
        ['-'], 
        ['-'], 
        ['-']
    ]
]

times = [
    [['09:00', '10:30'], ['10:45', '12:15'], ['13:00', '14:30'], ['14:40', '16:10'], ['16:20', '17:50']],
    [['09:00', '10:30'], ['10:45', '12:15'], ['13:00', '14:30'], ['14:40', '16:10'], ['16:20', '17:50']],
    [['09:00', '10:30'], ['10:45', '12:15'], ['13:00', '14:30'], ['14:40', '19:30']],
    [['09:00', '10:30'], ['10:45', '12:15'], ['13:00', '14:30'], ['14:40', '16:10'], ['16:20', '17:50']],
    [['09:00', '10:30'], ['10:45', '12:15'], ['13:00', '14:30'], ['14:40', '16:10'], ['16:20', '17:50']],
    [['09:00', '10:30'], ['10:45', '12:15'], ['13:00', '14:30'], ['14:40', '16:10']],
    [['-'], ['-'], ['-']]
    ]



# ------------- CMC206 -------------
subjects = [
    [
        ['Практикум на ЭВМ 658'], 
        ['Практикум на ЭВМ', 'МЗ-1'], 
        ['Практикум на ЭВМ 582'],
        ['Математический анализ', 'Домрина А.В. 637'], 
        ['Физическая культура']
    ],
    [
        ['Теорвер и матстат', 'Королев В.Ю. П-13'], 
        ['Математический анализ П-11', 'Крицков Л.В.'], 
        ['Английский язык', 'Беликова Е.К. 580'], 
        ['Обыкновенные дифференциальные ур-я', 'Павельева Е.А. 660'], 
        ['Английский язык', 'Кашелкина О.А. 736']
    ],
    [
        ['Теорвер и матстат', 'Пономаренко Л.С. 508'],
        ['Математический анализ П-6', 'Крицков Л.В.'], 
        ['Обыкновенные дифференциальные ур-я П-13', 'Денисов А.М.'], 
        ['Межфакультетские курсы']
    ],
    [
        ['Операционные системы П-13', 'Машечкин И.В'], 
        ['Операционные системы П-13', 'Машечкин И.В'], 
        ['Математический анализ', 'Домрина А.В. 637'], 
        ['Введение в численные методы П-6', 'Нефёдов В.В.']
    ],
    [
        [''], 
        ['Физическая культура'], 
        ['Классическая механика', 'Аксёнов В.Н. 660'], 
        ['Английский язык', 'Беликова Е.К. 582-а', 'Кашелкина О.А. 783'], 
        ['Классическая механика ЦФА', 'Никитин С.Ю.'], 
    ],
    [
        ['Философия П-14', 'Девятова С.В.'], 
        ['--- / Философия', 'Девятова С.В. 505']
    ],
    [
         ['-'], 
         ['-'], 
         ['-']
    ]
]

times = [
    [['08:45', '10:20'], ['10:30', '12:05'], ['12:50', '14:25'], ['14:35', '16:10'], ['16:50', '18:20']],
    [['08:45', '10:20'], ['10:30', '12:05'], ['12:15', '13:50'], ['14:35', '16:10'], ['16:20', '17:55']],
    [['08:45', '10:20'], ['10:30', '12:05'], ['12:15', '13:50'], ['15:10', '18:30']],
    [['08:45', '10:20'], ['10:30', '12:05'], ['12:15', '13:50'], ['14:35', '16:10'], ['16:20', '17:55']],
    [['08:45', '10:20'], ['10:50', '12:20'], ['12:50', '14:25'], ['14:35', '16:10'], ['16:20', '17:55']],
    [['08:45', '10:20'], ['10:30', '12:05'], ['12:15', '13:50'], ['14:35', '16:10']],
    [['-'], ['-'], ['-']]
    ]




# ------------- CMC321 -------------
subjects = [
    [
        [''], 
        ['Уравнения мат физики П-13'], 
        ['Прикладная алгебра П-8а'], 
        ['Уравнения мат физики 607'], 
        ['Язык Python П-5'], 
        ['']
    ],
    [
        ['Экономика П-8а'], 
        ['Экономика 658'], 
        ['Практикум МЗ-4', '(с 19-го МЗ-2)'], 
        ['ИМИРИС 582'], 
        ['ИМИРИС 582'], 
        ['']
    ],
    [
        ['Введение в сети ЭВМ П-14'], 
        ['Введение в сети ЭВМ П-14'], 
        ['Методы машинного обучения П-6'], 
        ['Межфакультетские курсы'], 
        [''], 
        ['']
    ],
    [
        ['--- / СКиПОД П-8а'], 
        ['СКиПОД П-8а'], 
        ['Базы данных П-14'], 
        ['Базы данных П-14'], 
        [''], 
        ['']
    ],
    [
        ['-'], 
        ['-'], 
        ['-']
    ],
    [
        ['-'], 
        ['-'], 
        ['-']
    ],
    [
        ['-'], 
        ['-'], 
        ['-']
    ]
]

times = [
    [['08:45', '10:20'], ['10:30', '12:05'], ['12:50', '14:25'], ['14:35', '16:10'], ['16:20', '17:55'], ['18:00', '19:30']],
    [['08:45', '10:20'], ['10:30', '12:05'], ['12:50', '14:25'], ['14:35', '16:10'], ['16:20', '17:55']],
    [['08:45', '10:20'], ['10:30', '12:05'], ['12:50', '14:25'], ['15:10', '18:30']],
    [['08:45', '10:20'], ['10:30', '12:05'], ['12:50', '14:25'], ['14:35', '16:10'], ['16:20', '17:55']],
    [['08:45', '10:20'], ['10:30', '12:05'], ['12:50', '14:25'], ['14:35', '16:10'], ['16:20', '17:55']],
    [['08:45', '10:20'], ['10:30', '12:05'], ['12:50', '14:25'], ['14:35', '16:10']],
    [['-'], ['-'], ['-']]
    ]


