# ------------- 106 -------------
subjects = [
    [
        ['РЯКР П-6'], 
        ['Практикум на ЭВМ 799 780'], 
        ['Алгебра и геометрия 504'], 
        ['Физическая культура'], 
        ['']
    ],
    [
        [''], 
        ['Алгебра и геометрия П-12'], 
        ['Математический анализ П-6'], 
        ['Английский язык 790 73'], 
        ['Математический анализ 605']
    ],
    [
        ['Архитектура ЭВМ П-5'], 
        ['Дискретная математика П-14'], 
        ['Практикум на ЭВМ 248 779'], 
        ['Межфакультетские курсы']
    ],
    [
        ['Алгебра и геометрия П-6'], 
        ['Математический анализ П-6'], 
        ['Алгебра и геометрия 504'], 
        ['']
    ],
    [
        ['Физическая культура'], 
        ['Дискретная математика П-14'], 
        ['Математический анализ 605'], 
        ['Английский язык 783']
    ],
    [
        ['Архитектура ЭВМ П-5'], 
        ['- / РЯКР 785'], 
        ['Дискретная математика 505'], 
        ['Английский язык 73']
    ],
    [
         ['-'], 
         ['-'], 
         ['-']
    ]
]

times = [
    [['08:45', '10:20'], ['10:30', '12:05'], ['12:15', '13:50'], ['14:35', '16:10']],
    [['08:45', '10:20'], ['10:30', '12:05'], ['12:50', '14:25'], ['14:35', '16:10'], ['16:20', '17:55']],
    [['08:45', '10:20'], ['10:30', '12:05'], ['12:50', '14:25'], ['15:10', '18:30']],
    [['08:45', '10:20'], ['10:30', '12:05'], ['12:15', '13:50'], ['14:35', '16:10'], ['16:20', '17:55']],
    [['08:45', '10:20'], ['10:30', '12:05'], ['12:50', '14:25'], ['14:35', '16:10'], ['16:20', '17:55']],
    [['08:45', '10:20'], ['10:30', '12:05'], ['12:50', '14:25'], ['14:35', '16:10']],
    [['-'], ['-'], ['-']]
    ]



# ------------- 206 -------------
subjects = [
    [
        ['Практикум на ЭВМ'], 
        ['Практикум на ЭВМ', 'МЗ-3'], 
        ['Теорвер и матстат', 'Королев В.Ю. П-12'], 
        ['Физическая культура'], 
        ['Правоведение П-14', 'Северин В.А.'], 
    ],
    [
        ['Английский язык', 'Кашелкина О.А. 783'], 
        ['Теорвер и матстат', 'Пономаренко Л.С. 508'], 
        ['Действительный и комплексный анализ', 'Домрина А.В. 637'], 
        ['']
    ],
    [
        ['Практикум на ЭВМ', 'Шестимеров А.А. 510'], 
        ['Действительный и комплексный анализ П-12', 'Крицков Л.В.'], 
        ['Обыкновенные дифференциальные ур-я П-14', 'Денисов А.М.'], 
        ['Межфакультетские курсы']
    ],
    [
        ['Системы программирования', 'Карпов Л.Е. П-14'], 
        ['Системы программирования', 'Карпов Л.Е. П-14'], 
        ['Обыкновенные дифференциальные ур-я', 'Павельева Е.А. 653'], 
        ['Английский язык', 'Беликова Е.К. 580', 'Кашелкина О.А. 71'], 
        ['Практикум на ЭВМ', 'Чернов А.В. 524']
    ],
    [
        [''], 
        ['Физическая культура'], 
        ['Электродинамика', 'Макаров В.А. ЦФА'], 
        ['']
    ],
    [
        ['Электродинамика', 'Урюпина Д.С. 660'], 
        ['Действительный и комплексный анализ П-5', 'Домрина А.В.'], 
        ['Действительный и комплексный анализ', 'Домрина А.В. 637'], 
        ['Английский язык', 'Беликова Е.К. 740']
    ],
    [
         ['-'], 
         ['-'], 
         ['-']
    ]
]

times = [
    [['08:45', '10:20'], ['10:30', '12:05'], ['12:15', '13:50'], ['14:20', '15:50'], ['17:20', '18:55']],
    [['08:45', '10:20'], ['10:30', '12:05'], ['12:15', '13:50'], ['14:35', '16:10'], ['16:20', '17:55']],
    [['08:45', '10:20'], ['10:30', '12:05'], ['12:15', '13:50'], ['15:10', '18:30']],
    [['08:45', '10:20'], ['10:30', '12:05'], ['12:15', '13:50'], ['14:35', '16:10'], ['16:20', '17:55']],
    [['08:45', '10:20'], ['10:00', '11:30'], ['12:40', '14:15'], ['14:35', '16:10'], ['16:20', '17:55']],
    [['08:45', '10:20'], ['10:30', '12:05'], ['12:15', '13:50'], ['14:35', '16:10']],
    [['-'], ['-'], ['-']]
    ]



# ------------- 211 -------------
subjects = [
    [
        [''], 
        ['Действительный и комплексный анализ П-14'], 
        ['Обыкновенные дифференциальные ур-я', '645'], 
        ['Физическая культура'], 
        ['Правоведение П-14', 'Северин В.А.']
    ],
    [
        ['Теорвер и матстат П-5'], 
        ['Действительный и комплексный анализ 605'], 
        ['Английский язык', 'Потапова 782'], 
        ['Действительный и комплексный анализ П-14']

    ],
    [
        ['Теорвер и матстат 606'], 
        ['Обыкновенные дифференциальные ур-я П-3'], 
        ['Действительный и комплексный анализ 605'], 
        ['Межфакультетские курсы']
    ],
    [

        ['Английский язык', 'Круглова 735'], 
        ['Электродинамика 659'], 
        ['Системы программирования П-14'], 
        ['Системы программирования П-14']

    ],
    [
        [''], 
        ['Физическая культура'], 
        ['Электродинамика ЦФА'], 
        ['Английский язык', 'Круглова 735', 'Потапова 790']
    ],
    [
        ['Практикум на ЭВМ 779 515'], 
        ['Практикум на ЭВМ 779 515'], 
        [''], 
        ['']
    ],
    [
         ['-'], 
         ['-'], 
         ['-']
    ]
]

times = [
    [['08:45', '10:20'], ['10:30', '12:05'], ['12:15', '13:50'], ['14:20', '15:50'], ['17:20', '18:55']],
    [['08:45', '10:20'], ['10:30', '12:05'], ['12:15', '13:50'], ['14:35', '16:10'], ['16:20', '17:55']],
    [['08:45', '10:20'], ['10:40', '12:15'], ['12:15', '13:50'], ['15:10', '18:30']],
    [['08:45', '10:20'], ['10:30', '12:05'], ['12:15', '13:50'], ['14:35', '16:10'], ['16:20', '17:55']],
    [['08:45', '10:20'], ['10:00', '11:30'], ['12:40', '14:15'], ['14:35', '16:10'], ['16:20', '17:55']],
    [['08:45', '10:20'], ['10:30', '12:05'], ['12:15', '13:50'], ['14:35', '16:10']],
    [['-'], ['-'], ['-']]
    ]


