# ---------------- 2022-2023 ----------------

# ------------- 106 -------------
subjects = [
    [
        ['РЯКР П-6'], 
        ['Практикум на ЭВМ 799 780'], 
        ['Алгебра и геометрия 504'], 
        ['Физическая культура'], 
        ['']
    ],
    [
        [''], 
        ['Алгебра и геометрия П-12'], 
        ['Математический анализ П-6'], 
        ['Английский язык 790 73'], 
        ['Математический анализ 605']
    ],
    [
        ['Архитектура ЭВМ П-5'], 
        ['Дискретная математика П-14'], 
        ['Практикум на ЭВМ 248 779'], 
        ['Межфакультетские курсы']
    ],
    [
        ['Алгебра и геометрия П-6'], 
        ['Математический анализ П-6'], 
        ['Алгебра и геометрия 504'], 
        ['']
    ],
    [
        ['Физическая культура'], 
        ['Дискретная математика П-14'], 
        ['Математический анализ 605'], 
        ['Английский язык 783']
    ],
    [
        ['Архитектура ЭВМ П-5'], 
        ['- / РЯКР 785'], 
        ['Дискретная математика 505'], 
        ['Английский язык 73']
    ],
    [
         ['-'], 
         ['-'], 
         ['-']
    ]
]

times = [
    [['08:45', '10:20'], ['10:30', '12:05'], ['12:15', '13:50'], ['14:35', '16:10']],
    [['08:45', '10:20'], ['10:30', '12:05'], ['12:50', '14:25'], ['14:35', '16:10'], ['16:20', '17:55']],
    [['08:45', '10:20'], ['10:30', '12:05'], ['12:50', '14:25'], ['15:10', '18:30']],
    [['08:45', '10:20'], ['10:30', '12:05'], ['12:15', '13:50'], ['14:35', '16:10'], ['16:20', '17:55']],
    [['08:45', '10:20'], ['10:30', '12:05'], ['12:50', '14:25'], ['14:35', '16:10'], ['16:20', '17:55']],
    [['08:45', '10:20'], ['10:30', '12:05'], ['12:50', '14:25'], ['14:35', '16:10']],
    [['-'], ['-'], ['-']]
    ]



# ------------- 206 -------------
subjects = [
    [
        ['Практикум на ЭВМ'], 
        ['Практикум на ЭВМ', 'МЗ-3'], 
        ['Теорвер и матстат', 'Королев В.Ю. П-12'], 
        ['Физическая культура'], 
        ['Правоведение П-14', 'Северин В.А.'], 
    ],
    [
        ['Английский язык', 'Кашелкина О.А. 783'], 
        ['Теорвер и матстат', 'Пономаренко Л.С. 508'], 
        ['Действительный и комплексный анализ', 'Домрина А.В. 637'], 
        ['']
    ],
    [
        ['Практикум на ЭВМ', 'Шестимеров А.А. 510'], 
        ['Действительный и комплексный анализ П-12', 'Крицков Л.В.'], 
        ['Обыкновенные дифференциальные ур-я П-14', 'Денисов А.М.'], 
        ['Межфакультетские курсы']
    ],
    [
        ['Системы программирования', 'Карпов Л.Е. П-14'], 
        ['Системы программирования', 'Карпов Л.Е. П-14'], 
        ['Обыкновенные дифференциальные ур-я', 'Павельева Е.А. 653'], 
        ['Английский язык', 'Беликова Е.К. 580', 'Кашелкина О.А. 71'], 
        ['Практикум на ЭВМ', 'Чернов А.В. 524']
    ],
    [
        [''], 
        ['Физическая культура'], 
        ['Электродинамика', 'Макаров В.А. ЦФА'], 
        ['']
    ],
    [
        ['Электродинамика', 'Урюпина Д.С. 660'], 
        ['Действительный и комплексный анализ П-5', 'Домрина А.В.'], 
        ['Действительный и комплексный анализ', 'Домрина А.В. 637'], 
        ['Английский язык', 'Беликова Е.К. 740']
    ],
    [
         ['-'], 
         ['-'], 
         ['-']
    ]
]

times = [
    [['08:45', '10:20'], ['10:30', '12:05'], ['12:15', '13:50'], ['14:20', '15:50'], ['17:20', '18:55']],
    [['08:45', '10:20'], ['10:30', '12:05'], ['12:15', '13:50'], ['14:35', '16:10'], ['16:20', '17:55']],
    [['08:45', '10:20'], ['10:30', '12:05'], ['12:15', '13:50'], ['15:10', '18:30']],
    [['08:45', '10:20'], ['10:30', '12:05'], ['12:15', '13:50'], ['14:35', '16:10'], ['16:20', '17:55']],
    [['08:45', '10:20'], ['10:00', '11:30'], ['12:40', '14:15'], ['14:35', '16:10'], ['16:20', '17:55']],
    [['08:45', '10:20'], ['10:30', '12:05'], ['12:15', '13:50'], ['14:35', '16:10']],
    [['-'], ['-'], ['-']]
    ]



# ------------- 211 -------------
subjects = [
    [
        [''], 
        ['Действительный и комплексный анализ П-14'], 
        ['Обыкновенные дифференциальные ур-я', '645'], 
        ['Физическая культура'], 
        ['Правоведение П-14', 'Северин В.А.']
    ],
    [
        ['Теорвер и матстат П-5'], 
        ['Действительный и комплексный анализ 605'], 
        ['Английский язык', 'Потапова 782'], 
        ['Действительный и комплексный анализ П-14']

    ],
    [
        ['Теорвер и матстат 606'], 
        ['Обыкновенные дифференциальные ур-я П-3'], 
        ['Действительный и комплексный анализ 605'], 
        ['Межфакультетские курсы']
    ],
    [

        ['Английский язык', 'Круглова 735'], 
        ['Электродинамика 659'], 
        ['Системы программирования П-14'], 
        ['Системы программирования П-14']

    ],
    [
        [''], 
        ['Физическая культура'], 
        ['Электродинамика ЦФА'], 
        ['Английский язык', 'Круглова 735', 'Потапова 790']
    ],
    [
        ['Практикум на ЭВМ 779 515'], 
        ['Практикум на ЭВМ 779 515'], 
        [''], 
        ['']
    ],
    [
         ['-'], 
         ['-'], 
         ['-']
    ]
]

times = [
    [['08:45', '10:20'], ['10:30', '12:05'], ['12:15', '13:50'], ['14:20', '15:50'], ['17:20', '18:55']],
    [['08:45', '10:20'], ['10:30', '12:05'], ['12:15', '13:50'], ['14:35', '16:10'], ['16:20', '17:55']],
    [['08:45', '10:20'], ['10:40', '12:15'], ['12:15', '13:50'], ['15:10', '18:30']],
    [['08:45', '10:20'], ['10:30', '12:05'], ['12:15', '13:50'], ['14:35', '16:10'], ['16:20', '17:55']],
    [['08:45', '10:20'], ['10:00', '11:30'], ['12:40', '14:15'], ['14:35', '16:10'], ['16:20', '17:55']],
    [['08:45', '10:20'], ['10:30', '12:05'], ['12:15', '13:50'], ['14:35', '16:10']],
    [['-'], ['-'], ['-']]
    ]



# ------------- Мех212 -------------
subjects = [
    [
        ['Действительный анализ П4'], 
        ['Дифференциальная геометрия П4'], 
        ['Мат анализ 447'], 
        ['Английский 449']
    ],
    [
        ['Дифференциальная геометрия 405'], 
        ['Мат анализ П4'], 
        ['Физическая культура'], 
        ['Английский 449'],
        ['Практикум 1610 / ---']

    ],
    [
        ['Диффуры П4'], 
        ['--- / Практикум 1305'], 
        ['Теорвер П4'], 
        ['Межфакультетские курсы']
    ],
    [

        ['-'], 
        ['-'], 
        ['-'], 
        ['-']

    ],
    [
        ['Работа на ЭВМ П4'], 
        ['Мат анализ П4'], 
        ['Физическая культура'], 
        ['Мат анализ 1415']
    ],
    [
        ['Теорвер 404'], 
        ['Диффуры 404'], 
        ['Практикум на ЭВМ 445'], 
        ['Действительный анализ 406']
    ],
    [
         ['-'], 
         ['-'], 
         ['-']
    ]
]

times = [
    [['09:00', '10:35'], ['10:45', '12:20'], ['13:15', '14:50'], ['15:00', '16:35']],
    [['09:00', '10:35'], ['10:45', '12:20'], ['13:15', '14:50'], ['15:00', '16:35'], ['16:40', '18:15']],
    [['09:00', '10:35'], ['10:45', '12:20'], ['13:15', '14:50'], ['15:00', '16:35']],
    [['09:00', '10:35'], ['10:45', '12:20'], ['13:15', '14:50'], ['15:00', '16:35']],
    [['09:00', '10:35'], ['10:45', '12:20'], ['13:15', '14:50'], ['15:00', '16:35']],
    [['09:00', '10:35'], ['10:45', '12:20'], ['13:15', '14:50'], ['15:00', '16:35']],
    [['-'], ['-'], ['-']]
    ]


# ------------- Фил -------------
subjects = [
    [
        [''], 
        ['Французский Сем 1028'], 
        [''], 
        ['Языки мира Лек П11'], 
        ['История Лек 1060'], 
        ['Латинский Сем 1028']
    ],
    [
        [''], 
        ['Синтаксис Лек П11'], 
        ['Синтаксис Сем П11'], 
        ['Семантика Лек П11'], 
        ['Семантика Сем П11'], 
        ['']
    ],
    [
        [''], 
        ['Фонетика Лек/Сем П11'], 
        ['Физическая культура'], 
        ['Межфакультетские курсы']
    ],
    [
        [''], 
        [''], 
        ['Линал и мат анализ Лек 844'], 
        ['Линал и мат анализ Сем 844'], 
        ['Древнерусский Лек/Сем 844'], 
        ['']
    ],
    [
        [''], 
        ['Психология Лек 951'], 
        ['Физическая культура'], 
        ['Французский Сем 1028'], 
        ['Французский Сем 1028'], 
        ['Латинский Сем 1028']
    ],
    [
         ['-'], 
         ['-'], 
         ['-']
    ],
    [
         ['-'], 
         ['-'], 
         ['-']
    ]
]

times = [
    [['09:00', '10:30'], ['10:45', '12:15'], ['13:00', '14:30'], ['14:40', '16:10'], ['16:20', '17:50'], ['18:00', '19:30']],
    [['09:00', '10:30'], ['10:45', '12:15'], ['13:00', '14:30'], ['14:40', '16:10'], ['16:20', '17:50'], ['18:00', '19:30']],
    [['09:00', '10:30'], ['10:45', '12:15'], ['13:00', '14:30'], ['14:40', '17:50']],
    [['09:00', '10:30'], ['10:45', '12:15'], ['13:00', '14:30'], ['14:40', '16:10'], ['16:20', '17:50'], ['18:00', '19:30']],
    [['09:00', '10:30'], ['10:45', '12:15'], ['13:00', '14:30'], ['14:40', '16:10'], ['16:20', '17:50'], ['18:00', '19:30']],
    [['-'], ['-'], ['-']],
    [['-'], ['-'], ['-']]
    ]




# ------------- 206 Sem 3 -------------

sem3 = [
    [
        ['Практикум на ЭВМ', 'Шестимеров А.А. 510', 'Чернов А.В. 526б'], 
        ['Практикум на ЭВМ', 'МЗ-3'], 
        ['Теорвер и матстат', 'Королев В.Ю. П-5'], 
        ['Физическая культура'], 
        ['Операционные системы', 'Шуваловский корпус В-2', 'Машечкин И.В., Попов И.С.'], 
        ['Операционные системы', 'Шуваловский корпус В-2']
    ],
    [
        ['Английский язык', 'Беликова Е.К. 580'], 
        ['Математический анализ П-3', 'Крицков Л.В.'], 
        ['Обыкновенные дифференциальные ур-я', 'Павельева Е.А. 605'], 
        ['']
    ],
    [
        ['Консультация по ЭВМ', 'Чернов А.В. 527'], 
        ['Математический анализ П-6', 'Крицков Л.В.'], 
        ['Обыкновенные дифференциальные ур-я П-12', 'Денисов А.М.'], 
        ['Межфакультетские курсы']
    ],
    [
        ['Классическая механика ЦФА', 'Никитин С.Ю.'], 
        ['-'], 
        ['Математический анализ', 'Домрина А.В. 637'], 
        ['Введение в численные методы П-5', 'Нефёдов В.В.'],
        ['Консультация по ЭВМ', 'Чернов А.В. 527']
    ],
    [
        [''], 
        ['Физическая культура'], 
        ['Теорвер и матстат', 'Пономаренко Л.С. 508'], 
        ['Английский язык', 'Беликова Е.К. 582-а', 'Кашелкина О.А. 783'], 
        ['Английский язык', 'Кашелкина О.А. 783']
    ],
    [
        ['Философия П-14', 'Девятова С.В.'], 
        ['Классическая механика', 'Магницкий С.А. 660'], 
        ['Философия', 'Конькова А.В.', '612 / -'], 
        ['Математический анализ', 'Домрина А.В. 637']
    ],
    [
         ['-'], 
         ['-'], 
         ['-']
    ]
]




