sem3 = [
    [
        ['Практикум на ЭВМ', 'Шестимеров А.А. 510', 'Чернов А.В. 526б'], 
        ['Практикум на ЭВМ', 'МЗ-3'], 
        ['Теорвер и матстат', 'Королев В.Ю. П-5'], 
        ['Физическая культура'], 
        ['Операционные системы', 'Шуваловский корпус В-2', 'Машечкин И.В., Попов И.С.'], 
        ['Операционные системы', 'Шуваловский корпус В-2']
    ],
    [
        ['Английский язык', 'Беликова Е.К. 580'], 
        ['Математический анализ П-3', 'Крицков Л.В.'], 
        ['Обыкновенные дифференциальные ур-я', 'Павельева Е.А. 605'], 
        ['']
    ],
    [
        ['Консультация по ЭВМ', 'Чернов А.В. 527'], 
        ['Математический анализ П-6', 'Крицков Л.В.'], 
        ['Обыкновенные дифференциальные ур-я П-12', 'Денисов А.М.'], 
        ['Межфакультетские курсы']
    ],
    [
        ['Классическая механика ЦФА', 'Никитин С.Ю.'], 
        ['-'], 
        ['Математический анализ', 'Домрина А.В. 637'], 
        ['Введение в численные методы П-5', 'Нефёдов В.В.'],
        ['Консультация по ЭВМ', 'Чернов А.В. 527']
    ],
    [
        [''], 
        ['Физическая культура'], 
        ['Теорвер и матстат', 'Пономаренко Л.С. 508'], 
        ['Английский язык', 'Беликова Е.К. 582-а', 'Кашелкина О.А. 783'], 
        ['Английский язык', 'Кашелкина О.А. 783']
    ],
    [
        ['Философия П-14', 'Девятова С.В.'], 
        ['Классическая механика', 'Магницкий С.А. 660'], 
        ['Философия', 'Конькова А.В.', '612 / -'], 
        ['Математический анализ', 'Домрина А.В. 637']
    ],
    [
         ['-'], 
         ['-'], 
         ['-']
    ]
]




